package task2.view;

import java.sql.SQLException;
/*
 * При открытии магазина пользовтелю предлагается выбор между входом в систему и регистрацией.
 * 
 * 	После пользователь выбирает между взятием снаряжения в ареду, сдачей арендованного снаряжения,
 * так же может посмотреть свое арендованное снаряжение
 * 	
 * Если пользователь берет в ареду снаряжене, он сначала выбирает категорию снаряжения,
 * затем само снаряжение, вводит дату, до какого числа арендует снаряжение.
 * 	Если пользователь сдает снаряджение, ему выводится список арендованного снаряжения, 
 * из которого он может выбрать, какое снаряжения сдать в аренду, введя его id
 * */

public class Main {
	public static void main(String[] args) throws SQLException{
		
		OpenShopView shop = new OpenShopView();
		shop.openShop();

	}

}
